---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarGeometryType
source: html/1b297ba5-692b-1011-5ffa-c5286c0e2798.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarGeometryType Property

"Geometry"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarGeometryType { get; }
```